### Terraform Plan (staging)

<details>
<summary>Click to expand plan</summary>

```
[command]/home/runner/work/_temp/919bcda8-bbdc-496a-abc3-b64088940a8c/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.file_uploader.module.api_gateway.aws_api_gateway_account.account will be created
  + resource "aws_api_gateway_account" "account" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + throttle_settings   = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_base_path_mapping.api_mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "api_mapping" {
      + api_id      = (known after apply)
      + domain_name = "staging-api-file-upload.epic-trip-planner.com"
      + id          = (known after apply)
      + region      = "eu-central-1"
      + stage_name  = "staging"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "eu-central-1"
      + rest_api_id  = (known after apply)
      + triggers     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_domain_name.api will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "staging-api-file-upload.epic-trip-planner.com"
      + domain_name_id                         = (known after apply)
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + region                                 = "eu-central-1"
      + regional_certificate_arn               = "arn:aws:acm:eu-central-1:387836084035:certificate/1543124e-071b-432e-af17-040651803d38"
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + routing_mode                           = (known after apply)
      + security_policy                        = "TLS_1_2"
      + tags                                   = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-api-file-upload.epic-trip-planner.com"
        }
      + tags_all                               = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-api-file-upload.epic-trip-planner.com"
        }

      + endpoint_configuration {
          + ip_address_type = (known after apply)
          + types           = [
              + "REGIONAL",
            ]
        }
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.lambda_integrations["files"] will be created
  + resource "aws_api_gateway_integration" "lambda_integrations" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.lambda_integrations["get-files-proxy"] will be created
  + resource "aws_api_gateway_integration" "lambda_integrations" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.lambda_integrations["upload-proxy"] will be created
  + resource "aws_api_gateway_integration" "lambda_integrations" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.lambda_integrations["upload-url"] will be created
  + resource "aws_api_gateway_integration" "lambda_integrations" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.options_integrations["files"] will be created
  + resource "aws_api_gateway_integration" "options_integrations" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "eu-central-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.options_integrations["get-files-proxy"] will be created
  + resource "aws_api_gateway_integration" "options_integrations" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "eu-central-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.options_integrations["upload-proxy"] will be created
  + resource "aws_api_gateway_integration" "options_integrations" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "eu-central-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration.options_integrations["upload-url"] will be created
  + resource "aws_api_gateway_integration" "options_integrations" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "eu-central-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration_response.options_integration_responses["files"] will be created
  + resource "aws_api_gateway_integration_response" "options_integration_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration_response.options_integration_responses["get-files-proxy"] will be created
  + resource "aws_api_gateway_integration_response" "options_integration_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration_response.options_integration_responses["upload-proxy"] will be created
  + resource "aws_api_gateway_integration_response" "options_integration_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_integration_response.options_integration_responses["upload-url"] will be created
  + resource "aws_api_gateway_integration_response" "options_integration_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.get_methods["files"] will be created
  + resource "aws_api_gateway_method" "get_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.get_methods["get-files-proxy"] will be created
  + resource "aws_api_gateway_method" "get_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.get_methods["upload-proxy"] will be created
  + resource "aws_api_gateway_method" "get_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.get_methods["upload-url"] will be created
  + resource "aws_api_gateway_method" "get_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.options_methods["files"] will be created
  + resource "aws_api_gateway_method" "options_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.options_methods["get-files-proxy"] will be created
  + resource "aws_api_gateway_method" "options_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.options_methods["upload-proxy"] will be created
  + resource "aws_api_gateway_method" "options_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method.options_methods["upload-url"] will be created
  + resource "aws_api_gateway_method" "options_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "eu-central-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method_response.options_responses["files"] will be created
  + resource "aws_api_gateway_method_response" "options_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method_response.options_responses["get-files-proxy"] will be created
  + resource "aws_api_gateway_method_response" "options_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method_response.options_responses["upload-proxy"] will be created
  + resource "aws_api_gateway_method_response" "options_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_method_response.options_responses["upload-url"] will be created
  + resource "aws_api_gateway_method_response" "options_responses" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_resource.routes["files"] will be created
  + resource "aws_api_gateway_resource" "routes" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "files"
      + region      = "eu-central-1"
      + rest_api_id = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_resource.routes["get-files-proxy"] will be created
  + resource "aws_api_gateway_resource" "routes" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "get-files-proxy"
      + region      = "eu-central-1"
      + rest_api_id = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_resource.routes["upload-proxy"] will be created
  + resource "aws_api_gateway_resource" "routes" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "upload-proxy"
      + region      = "eu-central-1"
      + rest_api_id = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_resource.routes["upload-url"] will be created
  + resource "aws_api_gateway_resource" "routes" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "upload-url"
      + region      = "eu-central-1"
      + rest_api_id = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Gateway for file-uploader backend endpoints"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "staging-file-uploader-api"
      + policy                       = (known after apply)
      + region                       = "eu-central-1"
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-file-uploader-api"
        }
      + tags_all                     = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-file-uploader-api"
        }
    }

  # module.file_uploader.module.api_gateway.aws_api_gateway_stage.api_gateway_stage will be created
  + resource "aws_api_gateway_stage" "api_gateway_stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + region               = "eu-central-1"
      + rest_api_id          = (known after apply)
      + stage_name           = "staging"
      + tags_all             = (known after apply)
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

  # module.file_uploader.module.api_gateway.aws_cloudwatch_log_group.api_gateway_access_logs will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_access_logs" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/apigw/staging-file-uploader-access-logs"
      + name_prefix                 = (known after apply)
      + region                      = "eu-central-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags_all                    = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_iam_role.cloudwatch_role will be created
  + resource "aws_iam_role" "cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-file-uploader-apigw-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_iam_role_policy_attachment.cloudwatch_attachment will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "staging-file-uploader-apigw-cloudwatch-role"
    }

  # module.file_uploader.module.api_gateway.aws_lambda_permission.apigw_routes_permissions["files"] will be created
  + resource "aws_lambda_permission" "apigw_routes_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-files"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_lambda_permission.apigw_routes_permissions["get-files-proxy"] will be created
  + resource "aws_lambda_permission" "apigw_routes_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-get-files-proxy"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_lambda_permission.apigw_routes_permissions["upload-proxy"] will be created
  + resource "aws_lambda_permission" "apigw_routes_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-upload-proxy"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.api_gateway.aws_lambda_permission.apigw_routes_permissions["upload-url"] will be created
  + resource "aws_lambda_permission" "apigw_routes_permissions" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke-upload-url"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.dynamodb.aws_dynamodb_table.files_metadata_table will be created
  + resource "aws_dynamodb_table" "files_metadata_table" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "id"
      + id                          = (known after apply)
      + name                        = "staging-file-uploader-files-metadata"
      + range_key                   = "file_key"
      + read_capacity               = (known after apply)
      + region                      = "eu-central-1"
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all                    = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "file_key"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # module.file_uploader.module.file_scanning.aws_lambda_permission.allow_s3_to_invoke_process_uploaded_file[0] will be created
  + resource "aws_lambda_permission" "allow_s3_to_invoke_process_uploaded_file" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "eu-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromS3"
      + statement_id_prefix = (known after apply)
    }

  # module.file_uploader.module.file_scanning.aws_s3_bucket_notification.source_notification[0] will be created
  + resource "aws_s3_bucket_notification" "source_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)
      + region      = "eu-central-1"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "uploads/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.file_uploader.module.lambda_functions["get_files"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for get-files lambda"
      + id               = (known after apply)
      + name             = "staging-file-uploader-lambda-get-files-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_functions["get_files"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-file-uploader-lambda-get-files-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_functions["get_files"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-file-uploader-lambda-get-files-exec-role"
    }

  # module.file_uploader.module.lambda_functions["get_files"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-file-uploader-lambda-get-files-exec-role"
    }

  # module.file_uploader.module.lambda_functions["get_files"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/file_uploader/submodules/lambda_function/lambda_get-files.zip"
      + function_name                  = "staging-file-uploader-get-files-lambda"
      + handler                        = "dist/index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-central-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "WX8TSZiobl+MvSQbZt5OQMBydgSKdzem3giVQ7dL90Y="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-files-lambda"
        }
      + tags_all                       = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-files-lambda"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for process-uploaded-file lambda"
      + id               = (known after apply)
      + name             = "staging-file-uploader-lambda-process-uploaded-file-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-file-uploader-lambda-process-uploaded-file-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-file-uploader-lambda-process-uploaded-file-exec-role"
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-file-uploader-lambda-process-uploaded-file-exec-role"
    }

  # module.file_uploader.module.lambda_functions["process_uploaded_file"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/file_uploader/submodules/lambda_function/lambda_process-uploaded-file.zip"
      + function_name                  = "staging-file-uploader-process-uploaded-file-lambda"
      + handler                        = "dist/index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-central-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "xbg5yTVuiXnZ6476H+UwHbybwGN+EfU5GMoYSj2IpyQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-process-uploaded-file-lambda"
        }
      + tags_all                       = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-process-uploaded-file-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_AV_ENABLED" = "false"
              + "DYNAMO_TABLE"      = "staging-file-uploader-files-metadata"
              + "PARTITION_KEY"     = "id"
              + "SORT_KEY"          = "file_key"
              + "THUMBNAIL_FOLDER"  = "thumbnails/"
              + "UPLOAD_FOLDER"     = "uploads/"
            }
        }
    }

  # module.file_uploader.module.lambda_functions["upload_file"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for upload-file lambda"
      + id               = (known after apply)
      + name             = "staging-file-uploader-lambda-upload-file-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_functions["upload_file"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-file-uploader-lambda-upload-file-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_functions["upload_file"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-file-uploader-lambda-upload-file-exec-role"
    }

  # module.file_uploader.module.lambda_functions["upload_file"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-file-uploader-lambda-upload-file-exec-role"
    }

  # module.file_uploader.module.lambda_functions["upload_file"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/file_uploader/submodules/lambda_function/lambda_upload-file.zip"
      + function_name                  = "staging-file-uploader-upload-file-lambda"
      + handler                        = "dist/index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-central-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "5v3Fn+W27erX90oyrI6marqvTK4CGHVwraS74GBPUyQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-upload-file-lambda"
        }
      + tags_all                       = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-upload-file-lambda"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.file_uploader.module.lambda_proxies_functions["get_files_proxy"].data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + excludes            = []
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/file_uploader/submodules/lambda_function/lambda_get-files-proxy.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/file_uploader/src/lambdas/get_files_proxy"
      + type                = "zip"
    }

  # module.file_uploader.module.lambda_proxies_functions["get_files_proxy"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for get-files-proxy lambda"
      + id               = (known after apply)
      + name             = "staging-file-uploader-lambda-get-files-proxy-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_proxies_functions["get_files_proxy"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-file-uploader-lambda-get-files-proxy-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_proxies_functions["get_files_proxy"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-file-uploader-lambda-get-files-proxy-exec-role"
    }

  # module.file_uploader.module.lambda_proxies_functions["get_files_proxy"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-file-uploader-lambda-get-files-proxy-exec-role"
    }

  # module.file_uploader.module.lambda_proxies_functions["get_files_proxy"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/file_uploader/submodules/lambda_function/lambda_get-files-proxy.zip"
      + function_name                  = "staging-file-uploader-get-files-proxy-lambda"
      + handler                        = "dist/index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-central-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-files-proxy-lambda"
        }
      + tags_all                       = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
          + "Name"        = "staging-get-files-proxy-lambda"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_GW_SECRET_TOKEN"         = (sensitive value)
              + "UPSTREAM_GET_FILES_ENDPOINT" = "https://staging-api-file-upload.epic-trip-planner.com/files"
            }
        }
    }

  # module.file_uploader.module.lambda_proxies_functions["upload_proxy"].data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + excludes            = []
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/file_uploader/submodules/lambda_function/lambda_upload-proxy.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/file_uploader/src/lambdas/upload_proxy"
      + type                = "zip"
    }

  # module.file_uploader.module.lambda_proxies_functions["upload_proxy"].aws_iam_policy.lambda_custom_policy will be created
  + resource "aws_iam_policy" "lambda_custom_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Custom policy for upload-proxy lambda"
      + id               = (known after apply)
      + name             = "staging-file-uploader-lambda-upload-proxy-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all         = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
    }

  # module.file_uploader.module.lambda_proxies_functions["upload_proxy"].aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-file-uploader-lambda-upload-proxy-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + tags_all              = {
          + "App"         = "file-uploader"
          + "Environment" = "staging"
        }
      + unique_id             = (known after apply)
    }

  # module.file_uploader.module.lambda_proxies_functions["upload_proxy"].aws_iam_role_policy_attachment.lambda_custom_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_custom_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-file-uploader-lambda-upload-proxy-exec-role"
    }

  # module.file_uploader.module.lambda_proxies_functions["upload_proxy"].aws_iam_role_policy_attachment.lambda_logging will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logging" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "staging-file-uploader-lambda-upload-proxy-exec-role"
    }

  # module.file_uplo

...(truncated)
```

</details>